var data = [];
var dataStr = '1. 北京海洋馆<br>\
<br>\
·炎炎夏日，我们相约去海洋馆。<br>\
·多了一分清凉，多了一份情谊!<br>\
·海豹摇手，海豚歌舞。<br>\
·观赏不同种类、不同外观，却各有千秋的海洋生物。<br>\
·美人相伴，夫复何求<br>\
<br>\
<br>\
2. 游览奥森向日葵<br>\
<br>\
·由于路线计划错误，产生了小矛盾。<br>\
·矛盾化解在璀璨的阳光里！<br>\
·矛盾化解在向日葵美景中！<br>\
·矛盾化解在落日余晖里！<br>\
·风景如画，秀色可餐，<br>\
<br>\
<br>\
3. 第一次秦皇岛之旅<br>\
<br>\
·这是我们第一次一起去旅行。<br>\
·这是第一次让我感觉到我们可以如此亲近！<br>\
·这是我们爱情开始的地方。<br>\
·为我们留下了一幕幕美好。<br>\
·在此，我们心靠得更近。<br>\
·在此，我们畅谈，没有距离。<br>\
<br>\
<br>\
4. 秦皇岛之山海关<br>\
<br>\
·这次秦皇岛之旅，来得那么突然，也那么幸福。<br>\
·雨游古长城入口，照了第一张抱着你的相片。<br>\
·从火车上一夜相伴，到海边的嬉笑打闹，到秦皇岛夜的谈心，再到山海关的落汤鸡，满满的都是幸福和满足。<br>\
<br>\
<br>\
5. 秦皇岛之山海关<br>\
<br>\
·这次秦皇岛之旅，来得那么突然，也那么幸福。<br>\
·雨游古长城入口，照了第一张抱着你的相片。<br>\
·从火车上一夜相伴，到海边的嬉笑打闹，到秦皇岛夜的谈心，再到山海关的落汤鸡，满满的都是幸福和满足。<br>\
<br>\
<br>\
6. 披星戴月写教案<br>\
<br>\
·第二次去天津，你工作不顺心，梨花带雨。<br>\
·两天时间里，都在伏案疾书。<br>\
·虽然最后交教案的时间延后好多，但还是看的很心疼<br>\
<br>\
<br>\
7. 你母校校庆<br>\
<br>\
·北交校庆<br>\
<br>\
<br>\
8.匆匆那年<br>\
<br>\
·那时候，我们以为喜欢就是永远。后来才发现，我们只有曾经，没有永远。<br>\
·我喜欢你 是我的 不是我的 我都喜欢<br>\
·在开始时毫无所谓，在结束时痛彻心扉。<br>\
·你可以打我，你可以骂我，但你千万不要说我没有努力过。<br>\
·我想从这里开始重新来过，和之前不一样的重新来过。<br>\
·既然已匆匆，不如早怀念。<br>\
<br>\
<br>\
9.同桌的妳<br>\
<br>\
·时间太长 我怕等不到你，距离太远 我怕追不上你，爱情太沉 我怕放不下你。<br>\
·这是我们两个人的事，我一个人办不到。<br>\
·总有一天，我会带你去只有我们两个人的地方。<br>\
·记忆总是喜欢添油加醋，它会朝着你期待的方向修改，当你欣喜若狂的时候，真相，会将你惊醒。<br>\
·总有一天，我会带你去只有我们两个人的地方。<br>\
<br>\
<br>\
10.灰姑娘<br>\
<br>\
·每个女孩，心中都有一只水晶鞋。<br>\
·Kindness is free. Love is free. 善良和爱都是免费的。<br>\
·Where there is kindness, there is goodness.And where there is goodness, there is magic. <br>\
·有善良之处即有美德，有美德之处即有魔力。<br>\
·我也不知道那只美丽的玻璃鞋能否合我的脚。但是……如果合脚，你能接受这个真实的我吗？<br>\
<br>\
<br>\
11.千与千寻<br>\
<br>\
·人生就是一列开往坟墓的列车，路途上会有很多站，很难有人可以自始至终陪着走完。当陪你的人要下车时，即使不舍也该心存感激，然后挥手道别。<br>\
·曾经发生过的事情不可能忘记，只不过是想不起而已。<br>\
·人永远不知道，谁哪次不经意的跟你说了再见之后，就真的不会再见了。<br>\
·我只能送你到这里了，剩下的路你要自己走，不要回头。<br>\
<br>\
<br>\
12.哆啦A梦：伴我同行<br>\
<br>\
·我一直在，守着你的天真和笑容。<br>\
·你总是这样轻言放弃的话，无论多久都只会原地踏步。<br>\
·一开始做不到的事就别吹牛啊！总是依靠我依靠我怎么行啊！偶尔也自己努力一下试试啊！<br>\
·每个人都有自己的任务，任务完成了，就离开吧。<br>\
·大雄：“我不想长高” 多啦A梦：“为什么” 大雄：“因为我长高了哆啦A梦就不能牵到我的手了”<br>\
<br>\
<br>\
13.冰雪奇缘<br>\
<br>\
·爱就是把某个人看得比你自己重要。<br>\
·你必须先结束一段不对的感情，才能发现那个最适合你的人。<br>\
·解救冰封的心，只能靠一个发自真爱的行动。<br>\
·做个好女孩，就像你从前一样。<br>\
<br>\
<br>\
14.超能陆战队<br>\
<br>\
·我长成这样是为了让人看起来更想拥抱。<br>\
·如果你生气了，就欺负我好了，反正我那么喜欢你。<br>\
·相信我，就算有一天，我们不小心走散，我也会回来找你的。<br>\
·为了你，我什么都会去做。只是有时候我笨手笨脚的，能不能不要怪我呢。<br>\
·我们有时并不想成为英雄，只是生活有时候超出我们的想象。<br>\
<br>\
<br>\
15.我的男友和狗<br>\
<br>\
·她不只是宠物，她是我的家人。<br>\
·不要每次吵架都不说话， 不说话不能解决问题。<br>\
·没有天生就会照顾孩子的父母。<br>\
·和她相处的每一分钟，都是那么珍贵。<br>\
·我是爸爸，你才是妈妈。<br>\
·人不是生来就懂得爱。<br>\
<br>\
<br>\
16.神偷奶爸<br>\
<br>\
·你装过头了 其实内在是一颗破碎的心。<br>\
·蹩脚的谎话 我甚至都不喜欢她<br>\
·Are you reallyabcgonna save the world? 你真的要拯救世界吗? Yes. Yes, I am. 是的是的 没错<br>\
·You just officially hadabcthe worst date ever. 你圆满完成了史上最糟糕约会<br>\
<br>\
<br>\
17.驯龙高手<br>\
<br>\
·我知道这希望渺茫，但是你不能总是保护他。<br>\
·哦，上帝不喜欢我。有些人会弄丢刀子，杯子。不，不应该是我啊！我弄丢了一条龙！<br>\
·我父亲让我用头去撞石头，我照做了。我觉得这很疯狂，但是我没问他为什么。<br>\
·不，你想错了，他在乎的不是你的外表，他看重的是你的灵魂。<br>\
<br>\
<br>\
18.奔跑吧！兄弟<br>\
<br>\
·邓超：We are 伐木累<br>\
·王宝强：What are you弄啥哩？<br>\
·Angelababy：Boom ShakaLaka<br>\
·王宝强：郑恺你怎么又死在女人手里了？<br>\
·陈赫：你是猪吗？<br>\
·李晨：我们来打一架吧！<br>\
<br>\
<br>\
19.老男孩猛龙过江<br>\
<br>\
·成长似乎就是不断发现，那些让自己魂牵梦绕的东西，原来都是一场场幻想，然后一次次从梦里醒过来，而现实从来连一点商量的余地都没有。<br>\
·如果你的梦想还没有实现,说明你的渴望还不够强烈!<br>\
·丢掉什么不重要，关键是找回来什么。<br>\
·生活就像镜子 你笑它就笑 你哭它就哭。<br>\
·分手还能做朋友,你问我爱你有多深。<br>\
<br>\
<br>\
';
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: "tmp/" + c[0].split('.')[0] + '.jpg',
        caption: c[0].split('.')[1],
        desc: c[1]
    });
    //console.log(c[0].replace('、', ' ') + '.jpg');
};